/*
 *
 *   ██████╗░██╗███████╗░██████╗░░█████╗░  ██╗░░░░░██╗███╗░░██╗░██████╗░
 *   ██╔══██╗██║██╔════╝██╔════╝░██╔══██╗  ██║░░░░░██║████╗░██║██╔════╝░
 *   ██║░░██║██║█████╗░░██║░░██╗░██║░░██║  ██║░░░░░██║██╔██╗██║██║░░██╗░
 *   ██║░░██║██║██╔══╝░░██║░░╚██╗██║░░██║  ██║░░░░░██║██║╚████║██║░░╚██╗
 *   ██████╔╝██║███████╗╚██████╔╝╚█████╔╝  ███████╗██║██║░╚███║╚██████╔╝
 *   ╚═════╝░╚═╝╚══════╝░╚═════╝░░╚════╝░  ╚══════╝╚═╝╚═╝░░╚══╝░╚═════╝░
 *
 *   Это программное обеспечение имеет лицензию, как это сказано в файле
 *   COPYING, который Вы должны были получить в рамках распространения ПО.
 *
 *   Использование, изменение, копирование, распространение, обмен/продажа
 *   могут выполняться исключительно в согласии с условиями файла COPYING.
 *
 *   Mail: diegoling33@gmail.com
 *
 */

package me.ling.kipfin.core.utils;

import me.ling.kipfin.core.callbacks.ECallbackWithException;

/**
 * Утилиты для исключений
 */
public class ExceptionUtils {

    public static boolean HUSH_NODE = false;

    /**
     * Тихое исключение
     *
     * Тихое исключение - некий свитеннер кода, котоый просто игнорирует исключения м
     * выводит стак-трейс
     *
     *
     * @param callback - обработчик
     */
    public static void silent(ECallbackWithException<Exception> callback) {
        try {
            callback.apply();
        } catch (Exception e) {
            if (!HUSH_NODE) e.printStackTrace();
            // Nothing is done
        }
    }


}
